// app.ts
App({
  globalData: {
    myObject: {
      1:{
        id:"1",
        name:"1号人",
        keyword: "创新与独立",
        advantage: "天生的领导者、管理能力、创造能力、创新能力、自信",
        disadvantage: "自我、孤独、沉迷者、傲慢、个人主义",
        baseDes:  "创新能力强，荣誉心强，有事业企图心，做事独立自主，自动自发。自尊心强，爱面子。主观固执，有主管老板的格局，有承担力，工作勤奋务实理智，为达目标不怕苦不怕难。",
        detail: "<p style='margin-top: 20px'>1号人，富有创意理解力，为人聪明，喜欢领导，主观意识强，我行我素，人际关系淡泊。</p><p style='margin-top: 20px'>乐观进取是你最为突出的天性。你知道怎么样为周遭的人带来和煦的阳光和灿烂的笑容。这样的特质，令你不论在工作人际中还是社交圈子内都非常吃得开，大家都会乐于跟你相处，也会被你的积极性感染到，让大家对你颇具信心。也会帮助你顺利的将周边环境与个人气场构架完成，让你能够全身心的投入其中，调动内心所有活力。</p><p style='margin-top: 20px'>你们总是拥有无穷的创意跟活跃的大脑，生活中细枝末节的小事都会让你展开联想，所以你是大家危难时刻寻求帮助的最佳人选，因为你总是会灵光一闪相处妙招。在工作上你会是所有人心中的创意先驱，你提出的想法总是充满新意又颇具高度，这种特质会吸引众多独具天赋的人在你身边，并且你们会在互动过程中保持长久和谐的友谊。<p style='margin-top: 20px'><p style='margin-top: 20px'>由于你天生旧有强大的气场，存在感总是十分强烈，加上性格本身的独立自主，很容易便会从人群中显露锋芒，很容易成为众人关注的焦点与私下谈论的对象。而你内心强烈的欲求也会帮助你实现众多阻碍，达成高难度的目标。你绝对有条件成为行业内的佼佼者。</p>",
        chartar:"<p style='margin-top: 20px'>1号人，是天生的领袖，独立，标新立异，满脑子新点子，总是不断地发掘新的事物。但这不是货真价实的创意，更像是异想天开。灵数1的人观念很特别，很难用言语形容。追随他们的人因其想法而更加独立、坚强。他们的领导力和独立性完全发挥出来的时候，可以建立更美好的人生。</p><p style='margin-top: 20px'>1号人，个性独立，不会事事依赖他人。适应力很强，对生活抱着悠闲自在的态度；喜欢随心所欲，想到就做；具有很好的个人才华，对自己要求通常很高，对做事的标准也同样很高。</p><p style='margin-top: 20px'>1号人，大多相当自负，对自己，别人要求都高。对于看不顺眼的人或事往往是“不假辞色拂袖而去”。不擅人际关系，个性又倔强内向，很少把心里话告诉别人，常常会给人高高在上的感觉。不会太在意别人的眼光，以领导者姿态自居。大胆，不按传统行事，喜欢独树一格，凡事依自己的方法去做，不与人同；兴趣广泛，不喜欢单调无聊的事，喜欢富有变化。</p>",
        talent: "天生具备领导才能。他们常能以非常明确或黑白分明的方式研判情势，因此很容易做出决定。他们也能一眼看出事情该如何运作才会更有力量，该采取怎样的策略手段才能确保独立。"
      },
      2:{
        id: "2",
        name: "2号人",
        keyword: "温和与直觉",
        advantage: "善于沟通、温和、有耐心、有韧性",
        disadvantage: '无主见、犹豫不决、优柔寡断、易受影响',
        baseDes:'有艺术美学品味，喜欢被温柔体贴对待，感性十足。自尊心强，主观固执，较不能听从别人建议，吃软不吃硬，刀子口豆腐心，喜欢被鼓励，怕被他人责骂指正，不喜欢被约束。内心有叛逆感。',
        detail:"<p style='margin-top: 20px'> 2号人，个性相对较为温和，善于分工合作，重视群体关系，喜欢受到别人的肯定，容易因为他人的意见而受到影响，不能忍耐孤独。</p><p style='margin-top:20px'>数字2带给你和平与外交的特质，没有人比你更适合做协调工作。你的合作意愿往往比其他人来得更加高一些，在他人眼里你的性格似乎纯粹的没有太多杂质，言行举止上也相当温和，总是用一种高雅的态度面对世界。</p><p style='margin-top: 20px'>你会避免跟任何人发生争斗，即便你在竞争中处于上风，也可能为了成全他人，维系和谐长久的关系将胜利拱手他人。这种性格实在不适合自己单打独斗或是独立开创一份事业。你最适合从事辅助者的角色，从旁提点协助他人成就一番事业。你们会非常乐于将他人的想法发展成为一套完整的体系，最终达成预期。</p><p style='margin-top: 20px'>不要过分追求面面俱到的完美，是你一生都需要克服的难题。这种生性害怕与人冲突的性格让你总是保持十足的谨慎与小心，但是这也使得你在为人处世的过程中顾虑太多，瞻前顾后浪费时间，甚至还有可能因为你的善举而产生误解。不要因为性格的牵绊使自己错失太多机会。</p><p style='margin-top:20px'>习惯退让也是你的弱点所在，发生矛盾时你总是不能坚持自己的立场，认为调整自己适应别人才是理所应当，反而容易让人利用这点，无论何时都应该保持适当的争取与合理的退让，别让不公平的事情在自己身上不断重复。</p>",
        chartar: "<p style='margin-top:20px'>2号人，一生都在不断追求简单真实的生活状态，并且会在跟人交往的过程中时刻保持真诚与善良的特质。你们总是希望将人与人之间的关系保持的更加纯粹、简单，在择友上你也会倾向于跟爽快直接的人交往。</p><p style='margin-top:20px'>2号人，的天赋是能同时看到事情的正反两面，而且会同时具有双重性格，生命灵数2的人另一项才能是能看清事务的本质。</p><p style='margin-top:20px'>2号人，善于分析，思路清晰，对外界的反应很敏感，具有高度的弹性，但很务实，善于解决问题；知识丰富，富有研究精神，喜欢辩论。</p><p style='margin-top:20px'>2号人，这些天赋得到发挥，便能名利双收，也就能独立生活，否则灵数2的人就会变得很挑剔，整天怨这怨那，还会把自己的失败怪在别人头上，自私自利，总觉得生活不尽人意，怨天尤人。</p><p style='margin-top:20px'>少数极端的还会因双元的天性，善于伪装而在背地犯下罪行，这是受挫折后发泄自我的方式。灵数2的人若天分得以表现，生活就会快乐又和谐。</p>",
        talent:"<p style='margin-top:20px'>善于分析问题，喜欢批评及发问。因此他们很适合从事各种需要做研究的工作。2号人也能把组合搭配的天分发挥于文字上，因此也展现出写作与沟通的才华。</p><p style='margin-top:20px'>2号人能和别人共事愉快，是绝佳的团队成员，而他们也宁可与人合作努力，而不愿意单打独斗。此外，2号人天生的二元并立特质，使得他们具备了表演方面的才华。</p>"
      },
      3: {
        id: "3",
        name: "3号人",
        keyword: "理想与美感",
        advantage: "一双慧眼、反应极快的脑袋、行动敏捷、多才多艺",
        disadvantage: "任性、情绪化、好奇心过重、花心",
        baseDes: "辩才无碍，机智幽默，很有人缘魅力，人际圆融，好奇心尝试心重，喜欢新鲜事物，喜外出交友谈心及旅游，博学多闻，学习领悟力强。喜欢吸收新知，包括流行资讯，点子多创意佳，做事喜欢有变化，不喜欢太呆板制式化，缺点是博学不精，注意力不集中，持续力不足(不是'那个'方面)，容易五分钟热度，虎头蛇尾。",
        detail: "<p style='margin-top: 20px'>3号人，聪明，有创意，多具有艺术天赋，表达能力较强，任性，只依自己的喜好行事，容易好高骛远。</p><p style='margin-top: 20px'>为这个世界带来无尽的欢乐是你一生的追求，你希望透过自己的感染力能让别人看到生命中更加光明、积极地一面。无论他人处于怎样的低沉晦暗状态，你总是能用自己高昂充沛的活力和乐观积极的态度鼓舞对方，唤起他们对生活应有的热忱。</p><p style='margin-top: 20px'>你认为生命原本短暂，倘若无法在有限的时间内充分享受美好，而把自己的精力、情绪浪费在惆怅过往、悔恨人生上，实在是太想不开了。所以，没有什么比消极的人生态度更让你无法接受的了。你总是时刻挥洒着自己的热情，运用自己温暖的性格和长久的耐性协助周遭的朋友在崎岖的生活道路上寻找平衡和光亮。</p><p style='margin-top: 20px'>你们是天生引导众生的人，有足够的能力让对方在困境中提炼出新的感悟。你最明白人生存在的价值跟意义，向往多姿多彩的人生以及各式各样奇妙的体验，你们善于融入各类人群中，欢乐的天性让所有人都乐于围绕在你身旁。</p>",
        chartar: "<p style='margin-top: 20px'>3号人，是一个完全被自己内心牵引，从而不断在自己的人生道路上选择方向的人。</p><p style='margin-top: 20px'>3号人，最大的才能是传达理想。3号人充满艺术细胞，极富想象力、梦想和创意，活力充沛，不断求新求变，有着崇高的理想，同时，人缘也很不错。最大的特征可说是有强烈的好奇心，对眼睛所见、耳朵所闻的一切，若不参与就不满意。</p><p style='margin-top: 20px'>33号人，最大的才能是传达理想。3号人充满艺术细胞，极富想象力、梦想和创意，活力充沛，不断求新求变，有着崇高的理想，同时，人缘也很不错。最大的特征可说是有强烈的好奇心，对眼睛所见、耳朵所闻的一切，若不参与就不满意。</p><p style='margin-top: 20px'>3号人，精力旺盛，敢于接受挑战，非常独立，忠实，值得信赖。</p><p style='margin-top: 20px'>3号人，善于学习，表达与沟通。</p>",
        talent: "<p style='margin-top: 20px'>有好几项才华，首先他们是表达高手，能让别人了解事实，接受真相。3号人用一种无形的方式为他们所经手的一切带来治疗与激励的效果。</p><p style='margin-top: 20px'>3号的人拥有丰富的创造力，能看出事物是什么模样，又应该如何呈现。这使得他们在创意工作上可以快速着手进行，尤其是在分析事物的外表看起来应该要是什么样子的时候，3号人的意见非常清楚。</p>"
      },
      4: {
        id: "4",
        name: "4号人",
        keyword: "安全与秩序",
        advantage: "总结、策划、细腻、周全",
        disadvantage: "固执、死板、说话直白、犹豫不定",
        baseDes: "做事务实理智,重秩序,喜欢干净整齐(有洁癖倾向),有系统归纳的能力,很有领导能力,具备主管老板的格局,喜欢从安定中求发展,做事脚踏实地按部就班,务实爱家,希望事业和家庭兼顾,是新好男人的代表。喜欢亲朋好友热闹温馨聚会。爱好舒适生活环境及美食,喜欢谈心聊天及肢体接触,善解人意,温柔体贴。",
        detail: "<p style='margin-top: 20px'>4号人，组织能力强，做事条理分明，目光敏锐，能迅速掌握重点，固执，缺乏安全感，不敢承担风险，因此容易让机会溜走。</p><p style='margin-top: 20px'>你们拥有高超的自制力以及对稳定生活的渴望，这一切都会成为你实现自己心中欲求的保障及源动力。你们的性格中没有太多拖泥带水的成分，目的性非常明确，不会掺杂太多怀疑、顾虑的情绪。你认为生活就是给自己定下一个个目标，然后逐一去实现，如果不做就永远都没有实现可能。</p><p style='margin-top: 20px'>你坚持认为只要自己努力，坚持不懈就一定会成功。完全没有投机心理，在你的世界观中只有脚踏实地，不断拼搏付出才会达成自己的目标。所以当面临天上掉馅饼这种美事的时候，你反而会难以置信，甚至怀疑那是不是真的。</p><p style='margin-top: 20px'>不过你们的性格让这种事极少发生，因为你们在生活中从来不懂的钻空子，也抗拒走捷径，所以基本上不会有一夜暴富的可能。你相信只有付出努力带来的成就才是最让人感觉安全的。</p><p style='margin-top: 20px'>你们习惯身处于熟悉的环境中，无论是人际关系、生活工作环境都是如此，你会非常依赖“熟悉”带来的踏实感受，这种日积月累的亲密关系会让你的心灵感觉自己是安全的，也是你不断付出努力追求物质成就的内在支持。</p>",
        chartar: "<p style='margin-top: 20px'>4号人，天生缺乏安全感，表示出强烈的不安全感，总是觉得自己不断受伤害，容易感到孤独、寂寞，时时感到惶惶不安，总觉得自己孤立无援，认为周围没有可以支撑他心理世界的人，并表现出一种强迫症倾向。睡觉前，总要反覆检验门锁上好没有；走夜路东张西望，生怕遭遇小偷或强盗；谈恋爱了，总会觉得对方不够完全付出，不能让他有依赖感，喜欢安逸的生活，比较务实，但往往很顽固，不喜欢变动。­</p><p style='margin-top: 20px'>4号人，有一点要谨记在心，他人开口求助才可以帮助别人，只有如此，别人才会尊重你的苦心，对人才真的有帮助。否则只是枉做好人，还要被人骂，不值得。灵数4的人若能善用组织能力和建立安全感的天赋过日子，就可以在生活中学习到安全感的真谛。只要掌握学习的时机，勇于改变，人生观正确，就能拥有任谁也夺不走的安全感。</p><p style='margin-top: 20px'>4号人，组织能力很强，懂得‘构思’，同时又给人安全稳定的感觉。他们目标明确，会集中精神去追求自己的目标。他们目光敏锐，面对当前状况，经常一目了然，以最有条不紊的方式迅速解决问题。因此，他们事业有成，聚财有方。但也由于不喜欢冒险，所以不大敢自己创业，希望风险让别人承担，自己只要轻轻松松，没有压力地专心发展就好。</p><p style='margin-top: 20px'>4号人善于看穿事情真相，待人处事有条有理，给人安定的感觉。尤其擅长于公司战略、组织设计、企业资讯系统建设、人力资源体系等方面的咨询。</p><p style='margin-top: 20px'>同时他们的组织能力也很强，懂得如何去建设、发展事业，就像明镜之水一样，给人安全稳定的感觉，感觉不到风险的存在，也许一切惊心动魄的事情你都感觉不到，因爲已经在无形之中处理就安然度过了。目标明确，精力集中，有条不紊也是4号人的天生优势。</p>",
        talent: "<p style='margin-top: 20px'>天生具备让事物更安全稳当的能力。和4号人在一起很舒服而安全，觉得他们是诚实而值得信赖的人。因此4号人非常适合从事任何必须讲究信用与可靠、注重安全的行业，例如保险业、银行等。</p><p style='margin-top: 20px'>4号人，能如实看见事物的样貌，实事求是，这使得他们能从事重复性高、别人也许觉得枯燥的工作。假如发生了问题，4号人不但能想出解决之道，还能设法防患未然，避免重蹈覆辙。</p><p style='margin-top: 20px'>4号人，不是常能冒出点子的创意之才，但他们很有本事改进别人的构想，使它精益求精。</p>"
      },
      5: {
        id: "5",
        name: "5号人",
        keyword: "自由与冒险",
        advantage: "天生领袖、目标明确、自由自在、幽默",
        disadvantage: "固执、逃避、猜疑、冲动",
        baseDes: "喜欢多采多姿的生活，希望工作就像游戏一样有趣。工作符合自己的兴趣才华，才会认真地投入，不喜欢太呆板的工作，也厌恶人事纠纷和複杂压力。喜好分明，自由随性，不受拘束。有冒险精神，多才多艺，点子多创意佳，敢于挑战尝试，做事喜欢创新有变化。",
        detail: "<p style='margin-top: 20px'>5号人，能言善辩，口才极佳，热情豪放，讲义气，崇尚自由，不喜欢被束缚，容易放纵，容易得罪人。</p><p style='margin-top: 20px'>“自由自在”就是你人生的关键词，你非常的抗拒束缚，需要极大的自我空间，无论是人际关系、规章制度还是生活带来的限制，都会让你感觉不快。如果要你长时间从事一分按部就班、毫无新意的工作，简直就像是将你困在笼子里一般，你一定会想要逃离。</p><p style='margin-top: 20px'>你的性格当然也会带给周围关心你的人很大的困惑，总会有人质疑你的生活态度，觉得你用吊儿郎当的态度生活、工作是不可取的，完全看不到你有任何稳定、踏实的迹象，亲人、好友甚至会十分担忧你的未来。</p><p style='margin-top: 20px'>但是你丝毫不会被这种劝说影响，还会用“你们其实并不了解自由的可贵”来反驳对方，事实上这也是你的真实想法，有什么比心灵的自由更让人兴奋的事儿呢？</p>",
        chartar: "<p style='margin-top: 20px'>5代表没有限制。5号人热爱自由，随心所欲，不自由毋宁死。5号人喜欢无拘无束，自由自在的生活。他们非常聪明，于是乎对自己和别人的要求都很高，几乎到了对任何事任何人都十分挑剔，当然，这种挑剔并不是恶意的。</p><p style='margin-top: 20px'>5号人，小时候都特别好奇，什么都想尝试，感觉就像在发掘自己真正的志向。他们对朋友可以说是绝对够义气，给朋友的感觉就是对人热情、豪爽，力所能及的事情都会鼎力相助、毫不计较。由于5数的人过于坦率直接，常常想到了什么就说什么，一不小心就会中伤他人，不瞭解的人往往因此而离开他。对此不要太介意，其实5号人通常都心地善良，对交心的朋友相当信任，对家人更是爱护有加。</p><p style='margin-top: 20px'>5号人，有点天真的感觉，经常认爲没有人会伤害自己，就像未识世途险恶，一旦要面对出现的一些残酷现实，会变得不知所措，甚至丧失信心。他们有原则，但绝对不喜欢被各种条条框框所约束，同时，5号人还喜欢冒险，尝试各种新事物，爱好旅游，常常会沉溺于自由自在的生活享受中。</p><p style='margin-top: 20px'>5号人，缺乏勇气，不大愿意放弃自由，因此不愿意受到限制，也会因此错失很多的机会。太过自由，放纵自己，并不是件好事，其实5号人自己也知道，但是，就是没有勇气克服这一点，常常无法控制自己。</p><p style='margin-top: 20px'>千万记住，你不能什么都要，到头来必定要有所取捨，要知道，其实放弃的同时也是获取。</p>",
        talent: "<p style='margin-top: 20px'>很善于应付三教九流的人，不但能与所有人沟通顺畅，还能使对方言听计从，这是其他人不容易做到的。</p><p style='margin-top: 20px'>５号人，很风趣，也很喜欢学习新知识，再加上口才一流，所以很多人喜欢跟他们相处，而５号人在团队里的合作向来轻松愉快。</p><p style='margin-top: 20px'>５号人，也擅于处理与人之间的应酬交际。有市场嗅觉，善于观察社会的整体趋势走向，他们喜欢不受契约约束的工作形态，自由接工作。</p>"
      },
      6: {
        id: "6",
        name: "6号人",
        keyword: "责任与奉献",
        advantage: "忠诚、远见、财富、智慧",
        disadvantage: "浪费、挑剔、吹毛求疵、自负、爱喋喋不休、给人有压迫感",
        baseDes: "6号人是忠诚、充满责任心的奉献者，具有远见、智慧和财富的可能。他们善解人意，情感细腻，喜欢帮助他人，但需要注意在奉献他人的同时保护好自己。",
        detail: "<p style='margin-top: 20px'>6号人，情感细腻，擅长人际交往，喜欢帮助他人，重承诺与责任，不理智时常会做出错误决定，付出不求回报时容易让自己受伤。你们的一生都离不开帮助他人、为人奉献，因为这样会让你觉得生命更加有意义。当你们无法改变这个世界，最好的选择就是改变自己！</p><p style='margin-top: 20px'>如果身处于困境中，你们一定要记住以不变应万变，进下心来聆听自我内在的声音，善于协调矛盾的天性会让你躲开众多纷争。如果你非要在一场纷争中胜出，其实你的机会并不是很大。反而用顺其自然的心态应对会让你获得更多的支持，事业也就有了回旋的余地。</p>",
        chartar: "<p style='margin-top: 20px'>6号人，一般比较善解人意，对他人的痛苦感同身受，但必须控制自己的情绪及投入的程度，多点理智，少点同情心。别帮人帮得过了头，累垮自己。帮助他人的本性是不会改变的，适当的学习一些治疗方面的东西，尤其是心理学，这样就可以迅速瞭解人心，找出问题。同时，要及时防止自己陷得太深，照顾好自己，再助他人一臂之力。</p><p style='margin-top: 20px'>6号人，像罗密欧与朱丽叶一样，因爲爱人胜过爱自己而饱受折磨。要爱人，必须先学会爱自己、帮助自己、治疗自己，否则关爱他人和治疗他人的注定失败。如果不懂得爱自己，也就无法找到真爱。连自己都不懂得去爱惜，怎么去爱别人呢？别人怎么会相信你的爱呢？</p><p style='margin-top: 20px'>因此，爱惜他人的同时，自我的赞美和自我的肯定也是不可少的。一个不懂得爱惜自己，不懂得珍视自己的人，永远也得不到别人的爱惜和珍视。爱或不爱，都是有条件的，而千条万条，最根本的一条：学会爱自己，肯定自己。然后，才有可能得到别人的爱，才有力量应付别人的不爱。</p><p style='margin-top: 20px'>其实，爱惜自己、珍视自己是起码的，因爲，爱惜自己首先是爱惜生命，珍视自己就是珍视生活。无论年轻或不再年轻，生命和生活对于我们都一样的可贵。一样的重要。</p><p style='margin-top: 20px'>6号人的人生课题就是学会照顾自己，学会爱自己。</p>",
        talent: "<p style='margin-top: 20px'>天生懂得照顾别人、修缮事物及解决问题。他们很快就能理清事情哪里出了错，也知道该采取哪些步骤来解决问题。他们待人接物的态度，套用医界常见的术语来形容就是［视病如亲］。此外６号人的想象力也很丰富，创新的点子也不少。</p>"
      },
      7:{
        id: '7',
        name: '7号人',
        keyword: '分析与真理',
        advantage:'洞察力强、幸运、人脉、贵人多、博学',
        disadvantage: '冷淡、迟缓、不体贴、行动力弱',
        baseDes:'分析力强，是实用主义者，但却常省小花大，外表理智务实，但内心情感丰富，感性重情义心软，常为情义衝动不理智。平易近人，是和平主义者，不喜与人勾心斗角，不喜人事纠纷，然而情绪会累积，一旦被激怒或自尊心受伤，就会情绪化，直言伤人，但其实是刀子口豆腐心，脾气来得快去的也快。',
        detail:"<p style='margin-top: 20px'>7号人，擅长钻研事物，喜欢追求真理，精于算计，遇事理智，处事不够圆滑，不容易被讨好，容易到手的东西不会珍惜。</p><p style='margin-top: 20px'>你经常觉得生命就是被众多疑问包裹的，需要不断的寻找出路与真理。不管你在这个世界中担任的角色是什么，大家都愿意给你留有足够的空间，因为在别人眼中你是个非常善解人意的人，这跟你内心的高度灵性是分不开的。</p><p style='margin-top: 20px'>还有一种幸运之神会附着在你的身上，那便是每当天灾人祸降临时，你总是侥幸逃脱的那一个，好像神灵在保护着你！正是因为你天生带有的好运，处处都能获得别人的帮助，危难时刻也会有贵人帮助你。保有好运的唯一方法是，不要太过急切，维持平稳的状态就好，否则事情可能变得越来越复杂，最终跟你的意愿背道而驰。</p>",
        chartar: "<p style='margin-top: 20px'>7号人，具备分析事物的天赋，喜欢质疑，寻求真理。</p><p style='margin-top: 20px'>分析和质疑是7号人的专长，他们精于研究、调查、寻找事情真相。除非百分之百肯定，否则他们对任何答案都无法满意。</p><p style='margin-top: 20px'>7号人，还有一个特点，不能算是天赋，他们似乎特别走运。由于他们的人生课题是追求至高无上的真理以及精神的世界，因此，他们手气不错，运气也很好，令所有人羡慕，仿佛上天特别照顾他们似的。</p><p style='margin-top: 20px'>7号人，天性擅长的就是分析能力，善于思考问题、分析问题、有正确的思想方法，有观察事物、分析事物、理解事物的能力，精于算计，所以给人感觉上比较冷酷，还有点情绪化，不容易讨好。</p> <p style='margin-top: 20px'>7号人的人生课题是找到真理时要敢于接受，抉择也须以真相爲基础。可是当他们接近真理的时候，却又逃避现实，心生畏惧，企图加以否认。不经一事，不长一智，智慧是从人与事之间磨练出来的，若因爲现实的一些困难或者难以接受的事实时，逃避现实，避开现实中的人或事，会磨平自己的意志，抹杀自己的才智，甚至丧失思考。</p>",
        talent:"<p style='margin-top: 20px'>7天生是评论家。他们的好奇心很重。他们也是天生的哲学家、研究者。由于7号人有一点懒散，所以喜欢从事有组织、有系统的事情，这些事可以让他们的理念立即实现。另外，错综复杂的事物也能引发7号人的兴趣。</p><p style='margin-top: 20px'>7号人，一眼就能看穿事情问题所在，因为他们对品质的概念非常先进，他们有一股天生的魅力，可以诱发别人最好的一面。</p>"
      },
      8:{
        id: '8',
        name: '8号人',
        keyword: '逻辑与智力',
        advantage:'责任、丰盛、富足、权力、亲善、有影响力、乐于助人',
        disadvantage: '压力、野心、消极、专制、追求虚名',
        baseDes:'独立自主，做事自动自发，自尊心强，主观固执，爱面子很有主见，喜欢自我管理。荣誉心强，事业企图心重，会追求权利。注重外表品质，对人事物高标淮要求。领导管理力强，重原则纪律，喜恶分明，注重经营效率，务实理智，外表有气势凌人的感觉，具有主管老板的格局。',
        detail:"<p style='margin-top: 20px'>8号人，喜欢冒险刺激，有商业头脑，喜欢追求权力，能即知即行，骄傲，对喜欢的东西异常执着，面对冲突时会勉强自己。</p><p style='margin-top: 20px'>8号人，总是比一般人更加坚强，你们面对任何困境都会有一种坚韧的力量支持下去。你们的存在感总是特别强烈，就算不可以表现自己，也很难不被他人注意到。星座网，你拥有天生的吸引力，总是会将众人吸引到自己身旁。</p><p style='margin-top: 20px'>这个数字会为你带来更多的权利与财富，同样的这也预示着你对这方面的欲望会比其他数字更强些。你对财富的注意力并非放在财多财少方面，而是应当如何有效的支配这些财富，在利用自己擅长的方式赚取更多金钱之后，你会因为这个成功的支配方式而获得心灵的满足。你能在这方面取得成功，完全在于你比其他人更加懂得如何利用财富，也能从中享受到乐趣。</p><p style='margin-top: 20px'>在权利方面的成功也是得益于这种善于运用的天赋。但是正因为你们太过了解财富与权利的奥秘，欲望又太过强烈，你们比一般人更容易铤而走险，钻法律漏洞，做出剑走偏锋之事。你们的成功学完全依赖通过自己的想象力将所有的创意、概念组织构架成一个大计划，在运用特殊的商业头脑来付诸实践。</p><p style='margin-top: 20px'></p>在感情上你是一个非常渴求真爱，需要不断被火辣热情的爱欲包围的人，家庭对你而言是非常重要的。所有被你认定是自己圈子内一员的人，都会得到你无微不至的照顾及保护，你对感情的态度丝毫不比搞任何大事业时松懈。</p>",
        chartar: "<p style='margin-top: 20px'>8号人，觉得自己有内涵，有能力啓发他人。并且拥有非常大的潜力潜伏在内心，一但发挥出来，任何人都要退避三舍，灵数8的人对应中国一句古话：不鸣则已，一鸣惊人。</p> <p style='margin-top: 20px'>8号人，不喜欢冲突，他们想取悦每一个人，因此掩饰自己真正的感觉，在不用取悦他人的时候，也不例外。掩饰就是不如实，8数因此经常与快乐、成功绝缘。</p><p style='margin-top: 20px'>8号人，天生权力欲和领导力强。能随情况需要，时而温和时而强悍。需要和他人共事，并有本领脱颖而出。同时，善于开发、培养，目光犀利，能侦察出事物的潜能，使理想实现，获得成功。善于捕捉机会，反应快、脑子活、执行力强、善于发现机会。善用这些天分8号人能轻易致富，坐拥权力。</p><p style='margin-top: 20px'>8号人，诚实、可靠，非常有商业头脑。他们对做生意兴趣浓厚，风险越大越觉刺激。适当发挥天赋的话，他们可以建立企业王国，财运极佳，一帆风顺。只要诚实就无往不利。</p><p style='margin-top: 20px'>8数的人独具慧眼，到最后拥有实权的还是他们。这种控制欲望能激起他们性格的黑暗面。骄傲、固执，权力熏心，将来会因此惹出大麻烦。要防患未然，最好先瞭解自己真正的心愿，诚实面对。其实他们知道，人生不只是钱和权。</p><p style='margin-top: 20px'>8号的人生课题是诚实，及适时反应，否则会损失健康和破财。</p><p style='margin-top: 20px'>8号人切记：一定要对自己诚实负责，否则就是自掘坟墓。</p>",
        talent: "<p style='margin-top: 20px'>具有天生比别人早一步看透事物的潜力。这提供了8号人极佳的市场优势而能赚进不少财富，因为８号人不怕风险，并且可以为了成功而不计一切投入；当然，这表示他们必须做出决定去争取。</p><p style='margin-top: 20px'>8号人，也很擅长帮助他人发现自我。8号人能与别人共事愉快，善于组织人事，具备优秀的领导能力。无论走到哪里，8号人浑身散发的高尚风范都相当吸引人。他们让人觉得值得信赖。8号人只要肯发挥就会成功。 </p>"
      },
      9:{
        id: '9',
        name: '9号人',
        keyword: '想象与人道',
        advantage:'大爱、正直、机会多、易得到认同',
        disadvantage: '贪心、无原则、怕失败、不专注',
        baseDes:'喜欢接近大自然，注重精神心灵哲学，有养生保健休閒观念。喜外出交友旅行，有宗教救世情怀，待人豪爽大方，开朗热忱，多情重义，喜好分明。希望工作符合自己的兴趣才华，一旦投入喜好的工作，工作勤奋狂热，一定要达成工作目标，而且急着有效率去做。但如果不注重或不想做的事，就会随性不拘谨。',
        detail:"<p style='margin-top: 20px'></p>9号人，充满生命力，能从创意之中获得满足感，处事随机应变，见招拆招，形势不务实，意志不够坚定，想象太过于丰富则会变成天马行空。</p><p style='margin-top: 20px'>这个数字告诉你必须学会顺其自然的方式面对生活，让自己成为懂得感激的人，你越早明白这一点，对你自己的帮助越大。数字9总是跟宇宙的运行、大自然的生态脱离不了关系。所以你拥有超越常人的开阔视野，对于跟人类相关的全球性话题总是非常关注。这种理念让你总是投身于服务人类心灵的工作。</p><p style='margin-top: 20px'>你懂得如何训练、培养自己成功达成设定的目标。只要是一切可以通过改变而取得成效的事儿，无论面临多少阻碍，你都会全力以赴。但是偶尔放下坚持，给自己几分轻松地感觉，也许效率反而会提高哦！</p><p style='margin-top: 20px'>有时你会因为过分担心他人的处境，超过自己的能力范围去帮助他人，反而将麻烦惹到自己身上。但是随着经验的不断累积，你会逐渐成熟，明白一个道理——世事难料，并不是所有事情都能解决，不如让他顺其自然的发展。</p><p style='margin-top: 20px'>9号人，通常都不会有一段关乎外国的婚姻，主要是异国恋情充满的神秘感对你来讲毫无意义，你更在乎的是人内在的本质，而非展现在外部的一切修饰。</p>",
        chartar: "<p style='margin-top: 20px'></p>9号人，想象力丰富，擅长帮助他人，带给他人快乐，学习新的事物时，能举一反三，青出于蓝。<p style='margin-top: 20px'>9号人，只要务实，目标明确、心智成熟，似乎就有神在暗中保佑。灵数9的人在扮演人生中的角色时，以神圣的态度来看待它，全力以赴，要时时刻刻监督自己，成功和名利都尽在自己的掌握之中</p>。<p style='margin-top: 20px'>9号人，的天赋才华是对人道主义的贡献。这种天分并不容易发挥，因爲这需要有自我牺牲。</p><p style='margin-top: 20px'>9号人，个性开朗，机灵活泼，口才好，人缘佳，见人说人话，见鬼说鬼话。足智多谋、反应灵敏，很善于交际。灵数9的人最大的能耐是随机应变。通常是多才多艺，但比较敏感，略带神经质，喜欢照顾他人，常常竭尽所能爲别人服务。</p><p style='margin-top: 20px'>但是他们的梦想和目标经常不切实际，有点脱离现实。充满生命力，喜欢忙碌的生活，对时尚有著敏锐的感觉。灵数9的人适合从事服务、娱乐、照顾他人的事业。</p><p style='margin-top: 20px'>灵数9的人对事情常常是三分钟热情，善变，缺乏个人处事的原则，过于神经质、做事情不够投入，过于圆滑，容易紧张，意志不够坚定，让人觉得不可靠、疑心重。</p><p style='margin-top: 20px'>灵数9的人的人生课题是要脚踏实地，真心付出不求回报。</p>",
        talent:"<p style='margin-top: 20px'>9号人，是超级的服务高手，能让人觉得被照顾得无微不至。他们不太在乎解决问题，而比较在意让人感受温馨。绽放一个微笑、讲一段笑话、来一个拥抱或一次举杯致意，都是9号人的风格</p>。<p style='margin-top: 20px'></p>9号人，有丰富的创意才华，而且是很棒的表演者。他们耐力惊人，永不放弃梦想。</p>"
      }
    }
  },
  onLaunch() {
  },
})